IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MARK PIC 9(03).

PROCEDURE DIVISION.
   ACCEPT WS-MARK.
   EVALUATE WS-MARK
    WHEN 90 THRU 100
      DISPLAY 'A'
    WHEN 80 THRU 89
      DISPLAY 'B' 
    WHEN 70 THRU 79 
      DISPLAY 'C' 
    WHEN 60 THRU 69 
      DISPLAY 'D' 
    WHEN 50 THRU 59 
      DISPLAY 'E'
    WHEN OTHER 
      DISPLAY 'F'
    END-EVALUATE.
STOP RUN.