IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM.
05 WS-NUM1 PIC 9(02).
05 WS-NUM2 PIC 9(02).
05 WS-NUM3 PIC 9(02).

PROCEDURE DIVISION.
   ACCEPT WS-NUM1.
   ACCEPT WS-NUM2.
   ACCEPT WS-NUM3.
    IF WS-NUM1 > WS-NUM2 AND WS-NUM1 > WS-NUM3
         DISPLAY "NUM 1 IS GREATER"
      ELSE
        IF WS-NUM2 > WS-NUM1 AND WS-NUM2 > WS-NUM3 DISPLAY "NUM 2 IS GREATER"
    ELSE
         DISPLAY "NUM 3 IS GREATER"
      END-IF
    END-IF.
STOP RUN.