IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-NUM        PIC 9(05).
01 WS-TEMP       PIC 9(05).
01 WS-REV        PIC 9(05) VALUE 0.
01 WS-REM        PIC 9(01).

PROCEDURE DIVISION.

    ACCEPT WS-NUM.
    MOVE WS-NUM TO WS-TEMP.

    PERFORM UNTIL WS-NUM = 0
        DIVIDE WS-NUM BY 10
            GIVING WS-NUM
            REMAINDER WS-REM
        COMPUTE WS-REV = (WS-REV * 10) + WS-REM
    END-PERFORM.

    IF WS-TEMP = WS-REV
        DISPLAY 'PALINDROME'
    ELSE
        DISPLAY 'NOT A PALINDROME'
    END-IF.

STOP RUN.
