IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-NUM PIC 9(03).
  
PROCEDURE DIVISION.
  MOVE 1 TO WS-NUM.
  PERFORM UNTIL WS-NUM > 100
    DISPLAY WS-NUM
  ADD 1 TO WS-NUM
  END-PERFORM.
  
STOP RUN.