IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM PIC 9(05).
01 WS-REV PIC 9(05) VALUE 0.
01 WS-REM PIC 9(01).
01 WS-QUOT PIC 9(05).

PROCEDURE DIVISION.
  ACCEPT WS-NUM.
  PERFORM UNTIL WS-NUM = 0
    DIVIDE WS-NUM BY 10 GIVING WS-QUOT 
            REMAINDER WS-REM
    COMPUTE WS-REV = (WS-REV * 10) + WS-REM
    MOVE WS-QUOT TO WS-NUM
  END-PERFORM.
  
DISPLAY 'REVERSED NUMBER: 'WS-REV.
STOP RUN.