IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

ENVIRONMENT DIVISION.
  CONFIGURATION SECTION.
  SOURCE-COMPUTER.  IBM-3278.
  OBJECT-COMPUTER.  IBM-3278.
  
DATA DIVISION.
  WORKING-STORAGE SECTION.
  
01 WS-SI.
   05 WS-PRIN  PIC 9(05)V99.
   05 WS-RATE  PIC 9(02).
   05 WS-TIME  PIC 9(02).

01 WS-RESULT   PIC 9(05)V99.
  

PROCEDURE DIVISION.
  ACCEPT WS-PRIN.
  ACCEPT WS-RATE.
  ACCEPT WS-TIME.
  
  COMPUTE WS-RESULT = (WS-PRIN * WS-RATE * WS-TIME) / 100.
  
  DISPLAY 'RESULT: 'WS-RESULT.

STOP RUN.