IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-TOTAL.
  05 WS-NUM OCCURS 20 TIMES PIC 9(03).
01 WS-I PIC 9(02).
01 WS-SUM PIC 9(05) VALUE 0.

PROCEDURE DIVISION.
  MOVE 1 TO WS-I.
  PERFORM UNTIL WS-I > 20
    ACCEPT WS-NUM(WS-I)
    ADD WS-NUM(WS-I) TO WS-SUM
    ADD 1 TO WS-I
  END-PERFORM.
  DISPLAY "SUM OF 20 NUMBERS IS: "WS-SUM.
  
STOP RUN.